export const ru = {
  about:
    'создан помогать эффективному выполнению поставленных задач командам и индивидуальным пользователям',
  team: 'Авторы:',
  toMain: 'главная',
  signin: 'вход',
  signup: 'регистрация',
  changeBgr: 'заменить фон',
  editProfile: 'Редактировать профиль',

  names: ['Сергей', 'Равганият', 'Елена'],
  jobs: [
    'Сборка проекта. CI/CD. Роутинг. Локализация. Хедер. Стили.',
    `Авторизация. Drag'n'drop. Профиль пользователя.`,
    'Страница приветствия и проекта. Стили.',
  ],
  gitHubLink: 'Гитхаб автора',
  addBoard: 'добавить борд',
  editUser: 'Редактировать профиль пользователя',
  signOut: 'Выход',
  boardList: 'Борды',
  addNewBoard: {
    addTitle: 'Добавьте название борда',
    title: 'заголовок',
    description: 'описание',
  },

  column: 'Колонка',
  task: 'Задача',
  added: ['добавлена', 'добавлен'],
  board: {
    header: 'Проект',
    description: 'Описание',
  },
  addColumn: {
    header: 'Добавьте новую колонку',
    title: 'название',
  },
  deleted: 'Удалено ',
  errors: {
    descriptionLength: 'Описание должно содержать от 3-х до 100 символов.',
    titleLength: 'Заголовок должен содержать от 3-х до 30 символов.',
    required: 'Это поле обязательно к заполнению!',
    userNameLength: 'Имя пользователя должно содержать от 3 до 20 символов..',
    passwLength: 'Пароль должен содержать от 6 до 10 символов.',
    wrongEmail: 'Это недействительный адрес электронной почты.',
    forbidToDeleteTask: 'Вы не можете удалить эту задачу',
  },
  buttons: {
    cancel: 'отмена',
    add: '+ добавить',
    delete: 'удалить',
    deleteUser: 'удалить пользователя',
    submit: 'отправить',
    signOut: 'выход',
    signIn: 'вход',
    signUp: 'зарегистрировать',
    save: 'сохранить изменения',
    delAcc: 'удалить профиль пользователя',
    redirect: 'перейти',
    addTask: 'добавить задачу',
    addColumn: 'добавить',
  },
  deletePopup: {
    title: 'Подтверждение удаления',
    description: 'Вы уверены, что хотите удалить пользователя?',
  },
  deleteColumn: {
    title: 'Подтверждение удаления',
    description: 'Вы уверены, что хотите удалить колонку',
  },
  deleteTask: {
    title: 'Подтверждение удаления',
    description: 'Вы уверены, что хотите удалить задачу',
  },
  redirectionPopup: {
    title: 'Подтверждение перехода',
    description: 'Перейти на главную страницу?',
  },
  editProfilePopup: {
    title: 'Редактирование профиля пользователя',
    description: 'Заполните все поля формы.',
  },
  signOutPopup: {
    title: 'Выход',
    description: 'Вы уверены, что хотите выйти?',
  },
  signInDialog: {
    title: 'Авторизация',
    havntAcc: 'У вас нет аккаунта? Регистрация',
  },
  formFieldsLabels: {
    email: 'Эл. почта',
    passw: 'Пароль',
    userName: 'Имя пользователя',
  },
  signUpDialog: {
    title: 'Регистрация нового пользователя',
  },
  accSettings: {
    title: 'Редактирование профиля пользователя',
    discription: 'Для редактирования профиля измените содержимое всех полей формы.',
    succes: 'Данные изменены',
  },
  addNewTask: {
    header: 'Добавить задачу',
    title: 'название',
    description: 'описание',
    user: 'исполнитель',
  },
  editTask: {
    header: 'Редактировать задачу',
  },
};
