export const ru = {
  about:
    'создан помогать эффективному выполнению поставленных задач командам и индивидуальным пользователям',
  team: 'Авторы:',
  toMain: 'главная',
  signin: 'вход',
  signup: 'регистрация',
  names: ['Сергей', 'Рая', 'Елена'],
  jobs: ['Сборка проекта. CI/CD.', 'Авторизация.', 'Страница приветствия'],
  gitHubLink: 'Гитхаб автора',
  addBoard: 'добавить карточку',
  editUser: 'Редактировать профиль пользователя',
  signOut: 'Выход',
  boardList: 'Список задач',
  addNewBoard: {
    addTitle: 'Добавьте название карточки',
    title: 'заголовок',
    errors: {
      titleLength: 'Заголовок должен содержать от 3-х до 30 символов.',
      required: 'Это поле обязательно к заполнению!',
    },
  },
  buttons: {
    cancel: 'отмена',
    add: '+ добавить',
    delete: 'удалить',
    deleteUser: 'удалить пользователя',
    submit: 'отправить',
  },
  deletePopup: {
    title: 'Подтверждение удаления',
    description: 'Вы уверены, что хотите удалить пользователя?',
  },
  editProfilePopup: {
    title: 'Редактирование профиля пользователя',
    description: 'Заполните все поля формы.',
  },
};
